### 테이블 형식으로 (IPython이나 Jupyter 환경에서만) 출력
.py에서도 인터렉티브 모드나, # %% 명령어로 하니 된다!

In [3]:
import pandas as pd

# CSV 파일 불러오기
df = pd.read_csv('titanic.csv')

# 모든 행과 열을 표시하도록 설정
pd.set_option('display.max_rows', None)  # 모든 행 표시
pd.set_option('display.max_columns', None)  # 모든 열 표시

# 데이터 출력(50개만 출력)
display(df.head(3))  # Jupyter Notebook에서 전체 테이블을 표시

# 데이터가 세로로 출력되면서 보기가 너무 힘들다. 엑셀로 분석은 다 하고, 칼럼 선택할 때만 Python 돌아오는 게 좋겠다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
df.columns

In [ ]:
df.shape #행과 열의 갯수로 이루어진 튜플을 반환

(891, 12)

In [ ]:
df.head(10) # 상위 몇개 반환

In [32]:
df_info = df.info() #non-null count, dtype, column
print(df_info)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [5]:
nullcnt = df.isnull().sum()
notnullcnt = df.notnull().sum()

print(nullcnt)
print()
print(notnullcnt)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [ ]:
nullnot = pd.concat([nullcnt + notnullcnt], axis=0)
print(nullnot)

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          891
Embarked       891
dtype: int64

In [23]:
# null 개수와 non-null 개수를 DataFrame으로 합치기
result_df = pd.DataFrame({
    'null_count': nullcnt,
    'notnull_count': notnullcnt,
    'full_number' : nullnot    
})

print(result_df)

             null_count  notnull_count  full_number
PassengerId           0            891          891
Survived              0            891          891
Pclass                0            891          891
Name                  0            891          891
Sex                   0            891          891
Age                 177            714          891
SibSp                 0            891          891
Parch                 0            891          891
Ticket                0            891          891
Fare                  0            891          891
Cabin               687            204          891
Embarked              2            889          891